// Inheritance
  //Ќаследование - это способность классов наследовать свойства других классов. ѕод свойствами в данном случае понимаю переменные и методы. 
//¬ наследовании различают родительский класс, который так же называют базовым и дочерний класс, который так же называют производным.  ласс может быть одновременно как базовым так и наследником.
//Ѕазовый класс не знает сколько и каких классов от него уноследованно. јдочерний класс знает только своего блтжайшего родител€.
/*Ќаследование реализует отношение между классами типа €вл€етс€, т. е. прежде чем что-то от чего-то унаследовать, нужно убедитьс€ в том, что что-то €вл€етс€ чем-то.  роме "€вл€етс€" есть ещЄ отношение между классами
* часть - целое(Hole-part). “акие отношени€ реализуютс€ с помощью аггрегировани€ и компазиции. јгрегирование - это когда часть и целое не могут существовать друг без друга.

*/